Project/Toir/src/Reports/торо_ОтчетПоОперациям/торо_ОтчетПоОперациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ОтчетПоОперациям</name>
</mdclass:Report>

Project/Toir/src/AccumulationRegisters/торо_ПроцентВыполненныхРабот/торо_ПроцентВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ПроцентВыполненныхРабот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.торо_ВидДокумента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ОперацииВнешнихОснованийДляРабот</registerRecords>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предписание_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>ОсновнаяИерархия</name>
      <description>Основная иерархия</description>
    </items>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныеЭлементыВДереве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Reports/торо_ОтчетПоОперациям/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
		|	ВТ_Данные.ДатаНачала КАК ДатаНачала,
		|	ВТ_Данные.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Данные.Операция КАК Операция,
		|	ВТ_Данные.ID_Операции КАК ID_Операции,
		|	ВТ_Данные.ПроцентПлан КАК ПроцентПлан,
		|	ВТ_Данные.ПроцентФакт КАК ПроцентФакт,
		|	ВТ_Данные.ОбъектРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|{ВЫБРАТЬ
		|	ОбъектРемонта.*,
		|	ВидРемонта.*,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	Операция.*,
		|	ID_Операции,
		|	ПроцентПлан,
		|	ПроцентФакт,
		|	ОбъектИерархии}
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
		|	ВТ_Данные.ДатаНачала КАК ДатаНачала,
		|	ВТ_Данные.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Данные.Операция КАК Операция,
		|	ВТ_Данные.ID_Операции КАК ID_Операции,
		|	ВТ_Данные.ПроцентПлан КАК ПроцентПлан,
		|	ВТ_Данные.ПроцентФакт КАК ПроцентФакт,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
		|{ВЫБРАТЬ
		|	ОбъектРемонта.*,
		|	ВидРемонта.*,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	Операция.*,
		|	ID_Операции,
		|	ПроцентПлан,
		|	ПроцентФакт,
		|	ОбъектИерархии}
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	торо_ПроцентВыполненныхРаботОбороты.IDРемонта КАК IDРемонта,
	|	торо_ПроцентВыполненныхРаботОбороты.IDОперации КАК IDОперации,
	|	торо_ПроцентВыполненныхРаботОбороты.Операция КАК Операция,
	|	торо_ПроцентВыполненныхРаботОбороты.IDРодителя КАК IDРодителя,
	|	торо_ПроцентВыполненныхРаботОбороты.ПроцентОборот КАК ПроцентОборот
	|ПОМЕСТИТЬ ВТ_План
	|ИЗ
	|	РегистрНакопления.торо_ПроцентВыполненныхРабот.Обороты(, , , ВидДокумента В (&СписокПлана)) КАК торо_ПроцентВыполненныхРаботОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	IDОперации,
	|	IDРодителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПроцентВыполненныхРаботОбороты.IDРемонта КАК IDРемонта,
	|	торо_ПроцентВыполненныхРаботОбороты.IDОперации КАК IDОперации,
	|	торо_ПроцентВыполненныхРаботОбороты.Операция КАК Операция,
	|	торо_ПроцентВыполненныхРаботОбороты.IDРодителя КАК IDРодителя,
	|	-торо_ПроцентВыполненныхРаботОбороты.ПроцентОборот КАК ПроцентОборот
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.торо_ПроцентВыполненныхРабот.Обороты(, , , ВидДокумента В (&СписокФакта)) КАК торо_ПроцентВыполненныхРаботОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	IDОперации,
	|	IDРодителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_План.IDРемонта, ВТ_Факт.IDРемонта) КАК IDРемонта,
	|	ЕСТЬNULL(ВТ_План.IDОперации, ВТ_Факт.IDОперации) КАК IDОперации,
	|	ЕСТЬNULL(ВТ_План.Операция, ВТ_Факт.Операция) КАК Операция,
	|	ЕСТЬNULL(ВТ_План.IDРодителя, ВТ_Факт.IDРодителя) КАК IDРодителя,
	|	ЕСТЬNULL(ВТ_План.ПроцентОборот, 0) КАК ПроцентПлан,
	|	ЕСТЬNULL(ВТ_Факт.ПроцентОборот, 0) КАК ПроцентФакт
	|ПОМЕСТИТЬ ВТ_ПланФакт
	|ИЗ
	|	ВТ_План КАК ВТ_План
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	|		ПО ВТ_План.IDРемонта = ВТ_Факт.IDРемонта
	|			И (ВТ_Факт.IDОперации = ВТ_План.IDОперации)
	|			И ВТ_План.IDРодителя = ВТ_Факт.IDРодителя
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонта,
	|	торо_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	торо_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	торо_Ремонты.ID КАК ID_Ремонта,
	|	ВТ_ПланФакт.Операция КАК Операция,
	|	ВТ_ПланФакт.IDОперации КАК ID_Операции,
	|	ВТ_ПланФакт.ПроцентПлан КАК ПроцентПлан,
	|	ВТ_ПланФакт.ПроцентФакт КАК ПроцентФакт,
	|	торо_Ремонты.ОбъектРемонта КАК ОбъектИерархии,
	|	торо_Ремонты.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
	|			ТОГДА 1
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	|			ТОГДА 2
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
	|			ТОГДА 3
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	|			ТОГДА 4
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК ТипДокумента
	|ПОМЕСТИТЬ ВТ_ДанныеСРегистратором
	|ИЗ
	|	ВТ_ПланФакт КАК ВТ_ПланФакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ПО ВТ_ПланФакт.IDРемонта = торо_Ремонты.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСРегистратором.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ДанныеСРегистратором.ВидРемонта КАК ВидРемонта,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВТ_ДанныеСРегистратором.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВТ_ДанныеСРегистратором.ДатаНачалаПлан
	|			ИНАЧЕ ВТ_ДанныеСРегистратором.ДатаНачалаФакт
	|		КОНЕЦ) КАК ДатаНачала,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_ДанныеСРегистратором.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВТ_ДанныеСРегистратором.ДатаОкончанияПлан
	|			ИНАЧЕ ВТ_ДанныеСРегистратором.ДатаОкончанияФакт
	|		КОНЕЦ) КАК ДатаОкончания,
	|	ВТ_ДанныеСРегистратором.ID_Ремонта КАК ID_Ремонта,
	|	ВТ_ДанныеСРегистратором.Операция КАК Операция,
	|	ВТ_ДанныеСРегистратором.ID_Операции КАК ID_Операции,
	|	ВТ_ДанныеСРегистратором.ПроцентПлан КАК ПроцентПлан,
	|	ВТ_ДанныеСРегистратором.ПроцентФакт КАК ПроцентФакт,
	|	ВТ_ДанныеСРегистратором.ОбъектИерархии КАК ОбъектИерархии
	|ПОМЕСТИТЬ ВТ_ДанныеСырые
	|ИЗ
	|	ВТ_ДанныеСРегистратором КАК ВТ_ДанныеСРегистратором
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ВТ_ДанныеСРегистратором.Регистратор) <> ТИП(Документ.торо_ВыявленныеДефекты)
	|	И ТИПЗНАЧЕНИЯ(ВТ_ДанныеСРегистратором.Регистратор) <> ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеСРегистратором.ОбъектРемонта,
	|	ВТ_ДанныеСРегистратором.ВидРемонта,
	|	ВТ_ДанныеСРегистратором.ID_Ремонта,
	|	ВТ_ДанныеСРегистратором.Операция,
	|	ВТ_ДанныеСРегистратором.ID_Операции,
	|	ВТ_ДанныеСРегистратором.ПроцентПлан,
	|	ВТ_ДанныеСРегистратором.ПроцентФакт,
	|	ВТ_ДанныеСРегистратором.ОбъектИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	ВидРемонта,
	|	ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСРегистратором.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ДанныеСРегистратором.ID_Ремонта КАК ID_Ремонта,
	|	ВТ_ДанныеСРегистратором.ОбъектИерархии КАК ОбъектИерархии,
	|	МИНИМУМ(ВТ_ДанныеСРегистратором.ТипДокумента) КАК ТипДокумента
	|ПОМЕСТИТЬ ВТ_ДанныеДокОснование
	|ИЗ
	|	ВТ_ДанныеСРегистратором КАК ВТ_ДанныеСРегистратором
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеСРегистратором.ОбъектРемонта,
	|	ВТ_ДанныеСРегистратором.ID_Ремонта,
	|	ВТ_ДанныеСРегистратором.ОбъектИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСырые.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ДанныеСырые.ВидРемонта КАК ВидРемонта,
	|	ВТ_ДанныеСырые.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДанныеСырые.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ДанныеСырые.ID_Ремонта КАК ID_Ремонта,
	|	ВТ_ДанныеСырые.Операция КАК Операция,
	|	ВТ_ДанныеСырые.ID_Операции КАК ID_Операции,
	|	СУММА(ВТ_ДанныеСырые.ПроцентПлан) КАК ПроцентПлан,
	|	СУММА(ВТ_ДанныеСырые.ПроцентФакт) КАК ПроцентФакт
	|ПОМЕСТИТЬ ВТ_Данные1
	|ИЗ
	|	ВТ_ДанныеСырые КАК ВТ_ДанныеСырые
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокОснование КАК ВТ_ДанныеДокОснование
	|		ПО (ВТ_ДанныеДокОснование.ОбъектРемонта = ВТ_ДанныеСырые.ОбъектРемонта)
	|			И (ВТ_ДанныеДокОснование.ID_Ремонта = ВТ_ДанныеСырые.ID_Ремонта)
	|ГДЕ
	|	(ВЫБОР
	|				КОГДА &ОтборПоВД
	|					ТОГДА ВТ_ДанныеДокОснование.ТипДокумента = 1
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА &ОтборПоВО
	|					ТОГДА ВТ_ДанныеДокОснование.ТипДокумента = 2
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА &ОтборПоППР
	|					ТОГДА ВТ_ДанныеДокОснование.ТипДокумента = 3
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА &ОтборПоРМ
	|					ТОГДА ВТ_ДанныеДокОснование.ТипДокумента = 4
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеСырые.ДатаОкончания,
	|	ВТ_ДанныеСырые.Операция,
	|	ВТ_ДанныеСырые.ID_Ремонта,
	|	ВТ_ДанныеСырые.ID_Операции,
	|	ВТ_ДанныеСырые.ДатаНачала,
	|	ВТ_ДанныеСырые.ВидРемонта,
	|	ВТ_ДанныеСырые.ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные1.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Данные1.ВидРемонта КАК ВидРемонта,
	|	ВТ_Данные1.ДатаНачала КАК ДатаНачала,
	|	ВТ_Данные1.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_Данные11.ID_Ремонта КАК ID_Ремонта,
	|	ВТ_Данные11.Операция КАК Операция,
	|	ВТ_Данные11.ID_Операции КАК ID_Операции,
	|	ВТ_Данные11.ПроцентПлан КАК ПроцентПлан,
	|	ВТ_Данные11.ПроцентФакт КАК ПроцентФакт
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_Данные1 КАК ВТ_Данные1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Данные1 КАК ВТ_Данные11
	|		ПО ВТ_Данные1.ID_Ремонта = ВТ_Данные11.ID_Ремонта
	|			И ВТ_Данные1.ID_Операции = ВТ_Данные11.ID_Операции
	|{ГДЕ
	|	(ВТ_Данные1.ДатаНачала >= &НачалоПериода
	|			И ВТ_Данные1.ДатаНачала <= &КонецПериода)}"
		
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// Соединение  ВТ_Данные1 с ВТ_Данные11 необходимо для того, чтобы СКД
	// не съедала группировку по ID_Операции. 
	
	Возврат ЗапросТекст;
	
КонецФункции

#КонецОбласти
